// Карась Д.Г.
// ПИ 2-1 
// Лабораторная работа 1

#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "ru");

	cout << "Работа номер 1: " << endl;
	cout << "--------------------------" << endl;
	int mass[10];

	cout << "Введите " << 10 << " элементов: "; // вводятся 10 элементов
	for (int i = 0; i < 10; i++)
		cin >> mass[i];

	for (int i = 0; i < 10; i++) // выполняются замены
	{
		if (mass[i] % 2 == 0) {
			mass[i] = 0;
		}
	}

	for (int i = 0; i < 10; i++) // выводится результт
		cout << mass[i] << " ";




	cout << endl << "Работа номер 2: " << endl;
	cout << "-------------------------------------" << endl;

	char ch;
		cout << "Введите символ: "; 
		cin >> ch;
		while (isdigit(ch) || isalpha(ch)) { // вводится символ и выполняется проверка что НЕанглоязычная буква и НЕцифра
			cout << "Введите символ: ";
			cin >> ch;
	}

	string str;
	cout << "Введите строку: ";
	cin >> str;
	bool status = true;

	for (int i = 0; i < str.length(); i++) {
		if (ch == str[i])
		{
			status = false;
			cout << "Символ на " << i + 1 << " месте в строке" << endl; // поиск места символа в строке
		}
	}

	if (status)
		cout << "Такого символа в строке нет!" << endl; // если не найден и статус true - символа нет

	cout << "Работа номер 3: " << endl;
	cout << "------------------------------------------" << endl;

	const int N = 3;
	int m[N][N];
	cout << "Заполните матрицу: " << endl;

	cout << "Заполните 9 значений матрицы слева направо: " << endl; // заполнение матрицы 3х3
	for (int i = 0; i < N; i++) {
		for (int j = 0; j < N; j++)
			cin >> m[i][j];
		cout << endl;
	}
	int result = m[0][0] * m[1][1] * m[2][2]		 // формула определителя
				+ m[2][0] * m[0][1] * m[1][2] +
				m[1][0] * m[2][1] * m[0][2] - m[2][0] * 
				m[1][1] * m[0][2] - m[0][0] * m[2][1] * m[1][2] - m[1][0] * m[0][1] * m[2][2];

	cout << "Определитель: " << result; // вывод

	return 0;
}